#include <stdio.h> // директива препроцессора, позволяет подключить библиотеку
// stdio = standard input/output - стандартная библиотека ввода вывода,
// где определена функция printf

int main()  // точка входа в программу
{

    printf("Sapere aude!\n"); // текст; '\n' - символ (1шт) перевода строки

    // тип данных - определяет размер выделенной под переменную ячейки памяти 
    // и то, как будет интерпретироваться ее содержимое
    
    // целые числа
    int a = 15;
    printf("a = %020d, size of a = %lu, a = %x\n", a, sizeof(a), a);
    // % - куда печатать переменную; 0 - заполнить незначащими нулями слева; 20 - всего 20 символов;
    // d - десятичное целое; x - 16-теричное целое
    
    // long unsigned int z = sizeof(a); // long unsigned int - тип возвращаемого значения функции sizeof,
    // которая возвращает размер переменной в байтах

    char b = 'A';
    printf("b = %c\n", b); // печатает сам символ
    printf("b = %d\n", b); // печатает его код в таблице ASCII
    printf("size of b = %lu\n", sizeof(b));

    // идентификаторы знаковый/беззнаковый тип (на примере char)
    signed char x=-128; // диапазон [-128; 127]
    unsigned char y=255; // диапазон [0; 255]
    printf("%d %u\n", x, y);
    // u - беззнаковое

    long long int e = 10000000;
    printf("e = %lld\n", e);
    // l - для длинных типов (от слова long)

    // с плавающей точкой
    float c = 5.678;
    printf("c = %07.2f\n", c);
    // % - куда печатать переменную; 
    // 0 и 7 - добавить 0 слева, так чтобы всего получилось 7 символов, считая точку;
    // .2 - 2 символа после запятой с округлением;
    // f - для чисел с плавающей точкой;
    
    double d = 5.0006;
    printf("d = %lf\n", d); // возможно так же %f, %lg, ...

    return 0;
}
